-- Создание таблицы "barbers"
CREATE TABLE barbers (
                         id INT AUTO_INCREMENT PRIMARY KEY,
                         name VARCHAR(255) NOT NULL,
                         specialization VARCHAR(255) NOT NULL,
                         schedule VARCHAR(255) NOT NULL,
                         image VARCHAR(255)
);

-- Вставка данных о барберах
INSERT INTO barbers (name, specialization, schedule, image) VALUES
                                                                ('John Doe', 'Стрижка', 'Пн-Пт: 9:00-18:00, Сб-Вс: выходной', 'john.jpg'),
                                                                ('Jane Smith', 'Бритье бороды', 'Пн-Сб: 10:00-20:00, Вс: 10:00-16:00', 'jane.jpg'),
                                                                ('Michael Johnson', 'Окраска волос', 'Пн-Сб: 8:00-17:00', 'michael.jpg'),
                                                                ('Emily Brown', 'Стрижка', 'Пн-Пт: 10:00-19:00, Сб: 9:00-17:00', 'emily.jpg'),
                                                                ('William Taylor', 'Бритье бороды', 'Пн-Ср: 11:00-20:00, Чт-Пт: 12:00-22:00, Сб-Вс: 10:00-18:00', 'william.jpg'),
                                                                ('Olivia Martinez', 'Стрижка', 'Пн-Вт: 8:00-15:00, Чт-Сб: 14:00-21:00', 'olivia.jpg'),
                                                                ('James Anderson', 'Окраска волос', 'Пн-Сб: 9:00-18:00', 'james.jpg'),
                                                                ('Sophia Wilson', 'Бритье бороды', 'Пн-Пт: 11:00-19:00, Сб: 10:00-16:00', 'sophia.jpg'),
                                                                ('David Garcia', 'Стрижка', 'Пн-Пт: 10:00-18:00, Сб: 9:00-15:00', 'david.jpg'),
                                                                ('Emma Brown', 'Окраска волос', 'Пн-Сб: 9:00-17:00', 'emma.jpg');


-- Создание таблицы "services"
CREATE TABLE services (
                          id INT AUTO_INCREMENT PRIMARY KEY,
                          name VARCHAR(255) NOT NULL,
                          price DECIMAL(10, 2) NOT NULL
);

-- Вставка данных о услугах
INSERT INTO services (name, price) VALUES
                                       ('Стрижка мужская', 20.00),
                                       ('Стрижка женская', 25.00),
                                       ('Окрашивание волос', 40.00),
                                       ('Причёска на выход', 30.00),
                                       ('Бритьё бороды', 15.00),
                                       ('Укладка волос', 25.00),
                                       ('Маникюр', 20.00),
                                       ('Педикюр', 25.00),
                                       ('Массаж спины', 30.00),
                                       ('Массаж шеи и плеч', 25.00),
                                       ('Спа-процедура для лица', 40.00),
                                       ('Уход за волосами', 35.00),
                                       ('Депиляция (восковая)', 20.00),
                                       ('Депиляция (широкий выбор зон)', 30.00),
                                       ('Уход за ногтями', 20.00),
                                       ('Комплексная процедура для ногтей', 35.00),
                                       ('Массаж стоп', 20.00),
                                       ('Пилинг тела', 40.00),
                                       ('Обертывание тела', 45.00),
                                       ('Уход за кожей лица', 35.00);

